app/Controllers/Frontoffice.php

SELECT DISTINCT `category`
FROM `menu`
SELECT *
FROM `menu`
---
    public function index()
    {
        $menu = new Menu();
        $data['categories'] = $menu->distinct()->select('category')->get()->getResultArray();
        $data['menu'] = $menu->findAll();